//===========================================================================
//!	@file   CameraTile.cpp
//!	@brief	デバッグカメラ
//===========================================================================
#include "CameraTitle.h"

//---------------------------------------------------------------------------
//! コンストラクタ
//---------------------------------------------------------------------------
CameraTitle::CameraTitle()
{
    setLookAt({0,2,0});

    pos_ = Vector3(0,8,0);

    speed_ = 0.01f;
    moveTo_ = 0;
}

//---------------------------------------------------------------------------
//! 更新
//---------------------------------------------------------------------------
void CameraTitle::update()
{
    // 視線ベクトルの回転
    float lenght;   // ２点間の距離
    lenght = 10.0f;

    moveTo_ += speed_;

    pos_.x_ = lenght * sinf(moveTo_);
    pos_.z_ = lenght * cosf(moveTo_);

    setPosition(pos_);

    // 親クラスを呼ぶ
    Camera::update();
}
