//===========================================================================
//!	@file	SceneController.h
//!	@brief	シーンコントローラー
//===========================================================================
#pragma once

//===========================================================================
//! シーンコントローラー
//===========================================================================
class SceneController
{
public:
    //! コンストラクタ
    SceneController();

    //! デストラクタ
    virtual  ~SceneController();

    //! 初期化
    bool initialize();

    //! 更新
    void update();

    //! 描画
    void render();

    //! 解放
    void finalize();

private:

    //! シーン切り替え
    void switchScene();

private:

    int mode_;      //!< シーンモード
    int prevMode_;  //!< 1フレーム前のシーンモード

};
