//===========================================================================
//!	@file	SceneController.cpp
//!	@brief	シーンコントローラー
//===========================================================================
#include "SceneController.h"

//---------------------------------------------------------------------------
//! コンストラクタ
//---------------------------------------------------------------------------
SceneController::SceneController()
{
    // TITLE
    // GAME
    // LOAD
    mode_     = SceneMode::TITLE;
    prevMode_ = SceneMode::MAX;
}

//---------------------------------------------------------------------------
//! デストラクタ
//---------------------------------------------------------------------------
SceneController::~SceneController()
{
}

//---------------------------------------------------------------------------
//! 初期化
//---------------------------------------------------------------------------
bool SceneController::initialize()
{
    return true;
}

//---------------------------------------------------------------------------
//! 更新
//---------------------------------------------------------------------------
void SceneController::update()
{
    // シーン切り替え
    switchScene();

    Scene::sceneUpdate();

    // 保存
    prevMode_ = mode_;
}

//---------------------------------------------------------------------------
//! 描画
//---------------------------------------------------------------------------
void SceneController::render()
{

    Scene::sceneRender();
    Scene::showImGuiWindow();

}

//---------------------------------------------------------------------------
//! 解放
//---------------------------------------------------------------------------
void SceneController::finalize()
{
}

//---------------------------------------------------------------------------
//! シーン切り替え
//---------------------------------------------------------------------------
void SceneController::switchScene()
{
    // 初回は取得しない
    if(prevMode_ != SceneMode::MAX) {
        mode_ = Scene::getMode();
    }

    if(mode_ != prevMode_) {
        switch(mode_) {
            case TITLE:
                Scene::sceneJump(new TitleScene());
                break;
            case GAME:
                Scene::sceneJump(new GameScene());
                break;
            case LOAD:
                Scene::sceneJump(new LoadScene());
            default:
                break;
        }
    }

}
