//---------------------------------------------------------------------------
//!	@file	IndexAllocator.cpp
//!	@brief	インデックス番号管理
//---------------------------------------------------------------------------
#include "IndexAllocator.h"

//---------------------------------------------------------------------------
// サイズ指定で初期化
//---------------------------------------------------------------------------
IndexAllocator::IndexAllocator(size_t capacity)
{
    indices_.reserve(capacity);

    // インデックス番号を登録
    for(u32 i = 0; i < capacity; ++i) {
        indices_.push_back(i | 0x80000000ul);
    }
}

//---------------------------------------------------------------------------
//! インデックス番号を確保
//---------------------------------------------------------------------------
u32 IndexAllocator::alloc()
{
    if(indices_.empty()) {
        return INVALID_VALUE;
    }

    auto value = indices_.back();
    indices_.pop_back();
    return value;
}

//---------------------------------------------------------------------------
//! インデックス番号を解放
//---------------------------------------------------------------------------
void IndexAllocator::free(u32 index)
{
    ASSERT_MESSAGE(index & 0x80000000ul, "不正なハンドルです。");
    ASSERT_MESSAGE(indices_.size() <= indices_.capacity(), "最大サイズを超えて解放しました。");

    indices_.push_back(index);
}
